---
title: Water
classe: Autodesk.Revit.DB.Visual.Water
namespace: Autodesk.Revit.DB.Visual
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 7
---

# Water

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `String CommonTintColor { get; }` | `Water.CommonTintColor` | String |
| `String CommonTintToggle { get; }` | `Water.CommonTintToggle` | String |
| `String WaterBumpAmount { get; }` | `Water.WaterBumpAmount` | String |
| `String WaterColorByObject { get; }` | `Water.WaterColorByObject` | String |
| `String WaterTintColor { get; }` | `Water.WaterTintColor` | String |
| `String WaterTintEnable { get; }` | `Water.WaterTintEnable` | String |
| `String WaterType { get; }` | `Water.WaterType` | String |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```